backend/tests/performance/scenarios/test-backend-v1.yml
config:
  environments:
    api-perf:
      target: "http://backend:8080"
      phases:
        - duration: 30
          arrivalRate: 2
        - duration: 30
          arrivalRate: 2
        - duration: 30
          arrivalRate: 5
        - duration: 30
          arrivalRate: 10
        - duration: 30
          arrivalRate: 20
        - duration: 60
          arrivalRate: 50
      payload:
        - path: names.csv
          fields:
            - firstName
            - id
            - country
            - commune
            - birthDate
            - lastName
          order: random
          # the following doesn't work
          skipHeader: true
          #delimiter: ";"
scenarios:
  - name: backend-v1
    flow:
    - get:
        url: "/deces/api/v1/search?firstName={{ firstName }}&lastName={{ lastName }}&birthDate={{ birthDate }}"
    - post:
        url: /deces/api/v1/search
        json:
          firstName: "{{ firstName }}"
          lastName: "{{ lastName }}"
          birthDate: "{{ birthDate }}"