backend/tests/performance/scenarios/test-backend-v1.yml
config:
  plugins:
    expect:
      reportFailuresAsErrors: true
      outputFormat: prettyError
    ensure:
      maxErrorRate: 1
      max: 500
      p95: 200
  environments:
    api-perf:
      target: "http://backend:8080"
      phases:
        - duration: 30
          arrivalRate: 2
        - duration: 30
          arrivalRate: 2
        - duration: 30
          arrivalRate: 5
        - duration: 30
          arrivalRate: 10
        - duration: 30
          arrivalRate: 20
        - duration: 60
          arrivalRate: 50
      payload:
        - path: names.csv
          fields:
            - lastName
            - id
            - country
            - commune
            - birthDate
            - firstName
          order: random
          skipHeader: true
          delimiter: ";"
scenarios:
  - name: backend-v1
    flow:
    - get:
        url: "/deces/api/v1/search?firstName={{ firstName }}&lastName={{ lastName }}&birthDate={{ birthDate }}&fuzzy=false"
        expect:
            - statusCode: 200
            - contentType: json
        capture:
          - json: '$'
            as: resultGet
    #- log: "Res GET: {{ resultGet }}"
    - post:
        url: /deces/api/v1/search
        json:
          firstName: "{{ firstName }}"
          lastName: "{{ lastName }}"
          birthDate: "{{ birthDate }}"
        capture:
          - json: '$'
            as: resultPost
        expect:
            - statusCode: 200
            - contentType: json
    #- log: "Res POST: {{ resultPost }}"